#ifndef TIMER_H
#define TIMER_H
//------------------------------------------------

//------------------------------------------------
//  マクロ定義(Macro definition)
//------------------------------------------------


//------------------------------------------------
//  型定義(Type definition)
//------------------------------------------------


//------------------------------------------------
//  プロトタイプ宣言(Prototype declaration)
//------------------------------------------------
void Timer_init(void);
unsigned long Timer_getTime(void);
void Timer_waitTime(unsigned long msec);
void Timer_interruptHandler(void);

//------------------------------------------------
#endif